Revit 2027 API
ParameterTypeId.ViewScaleHavename Property
 "Display Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewScaleHavename { get; }
Public Shared ReadOnly Property ViewScaleHavename As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewScaleHavename {
	ForgeTypeId^ get ();
}
static member ViewScaleHavename : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace